In [36]:
import pandas as pd; pd.set_option('display.max_columns', 50)
import numpy as np
import matplotlib.pyplot as plt

## Reading the data file
credit_card = pd.read_excel('default of credit card clients.xls', skiprows = 1)
credit_card.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,PAY_6,BILL_AMT1,BILL_AMT2,BILL_AMT3,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,1,20000,2,2,1,24,2,2,-1,-1,-2,-2,3913,3102,689,0,0,0,0,689,0,0,0,0,1
1,2,120000,2,2,2,26,-1,2,0,0,0,2,2682,1725,2682,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,3,90000,2,2,2,34,0,0,0,0,0,0,29239,14027,13559,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,4,50000,2,2,1,37,0,0,0,0,0,0,46990,48233,49291,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
4,5,50000,1,2,1,57,-1,0,-1,0,0,0,8617,5670,35835,20940,19146,19131,2000,36681,10000,9000,689,679,0

In [37]:
## Splitting the data into train and test
train = credit_card.groupby('default payment next month', group_keys = False).apply(lambda x: x.sample(frac = 0.8))
test = credit_card[~np.isin(credit_card['ID'], train['ID'])]

## Dropping ID 
train = train.drop(columns = 'ID', axis = 1)
test = test.drop(columns = 'ID', axis = 1)

test_target = test['default payment next month']
test = test.drop(columns = 'default payment next month', axis = 1)

## Writing the data to csv 
train.to_csv('train.csv', index = False)
test.to_csv('test.csv', index = False)
test_target.to_csv('test_target.csv', index = False)

## Answering Questions

In [2]:
import pandas as pd; pd.set_option('display.max_columns', 50)
import numpy as np
import matplotlib.pyplot as plt
from sklearn.tree import DecisionTreeClassifier, plot_tree
from sklearn.ensemble import RandomForestClassifier

## Reading data files
train = pd.read_csv('train.csv')
test = pd.read_csv('test.csv')

# ## Chaning labels
# train['SEX'] = np.where(train['SEX'] == 1, 'male', 'female')
# train['EDUCATION'] = np.where(train['EDUCATION'] == 1, 'graduate_school', 
#                               np.where(train['EDUCATION'] == 2, 'university',
#                                        np.where(train['EDUCATION'] == 3, 'high_school', 'other_unknown')))
# train['MARRIAGE'] = np.where(train['MARRIAGE'] == 1, 'married', 
#                              np.where(train['MARRIAGE'] == 2, 'single', 'other'))

## Creating ID columns
train['ID'] = list(range(1, train.shape[0] + 1))

## Splitting the data into train and test
training = train.groupby('default payment next month', group_keys = False).apply(lambda x: x.sample(frac = 0.8))
testing = train[~np.isin(train['ID'], training['ID'])]

## Dropping ID
training = training.drop(columns = 'ID', axis = 1)
testing = testing.drop(columns = 'ID', axis = 1)

In [3]:
train['SEX'].value_counts()

2    14561
1     9439
Name: SEX, dtype: int64

In [20]:
train.head()

,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,PAY_6,BILL_AMT1,BILL_AMT2,BILL_AMT3,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month,ID
0,400000,1,1,2,32,0,0,0,0,0,0,55773,55917,51389,48272,49478,51242,3028,3023,3000,3000,3000,38662,0,1
1,120000,2,2,2,30,-1,-1,-1,-1,-1,-1,140,3230,3011,1964,1883,1538,3230,3011,1964,1883,1538,1911,0,2
2,270000,2,2,2,32,0,0,0,0,0,0,59710,49986,104390,94856,86461,83650,1808,69563,2891,2689,3012,2771,0,3
3,280000,2,2,1,27,0,0,0,0,0,0,280913,283222,273160,257689,193231,191143,11052,9563,15017,5374,5420,6021,0,4
4,30000,2,1,2,27,0,0,-1,0,0,-2,1512,2458,664,1814,0,0,1000,664,1500,0,0,0,0,5

In [12]:
training['SEX'].value_counts() / training.shape[0]

2    0.606094
1    0.393906
Name: SEX, dtype: float64

In [14]:
testing['SEX'].value_counts() / testing.shape[0]

2    0.609167
1    0.390833
Name: SEX, dtype: float64

In [16]:
training['EDUCATION'].value_counts() / training.shape[0]

2    0.470729
1    0.349844
3    0.163854
5    0.009479
4    0.003750
6    0.001719
0    0.000625
Name: EDUCATION, dtype: float64

In [17]:
testing['EDUCATION'].value_counts() / testing.shape[0]

2    0.466042
1    0.359583
3    0.161042
5    0.008542
4    0.003542
6    0.001042
0    0.000208
Name: EDUCATION, dtype: float64

In [18]:
training['MARRIAGE'].value_counts() / training.shape[0]

2    0.527760
1    0.459375
3    0.011146
0    0.001719
Name: MARRIAGE, dtype: float64

In [19]:
testing['MARRIAGE'].value_counts() / testing.shape[0]

2    0.542500
1    0.445208
3    0.010625
0    0.001667
Name: MARRIAGE, dtype: float64

In [21]:
training['PAY_2'].value_counts() / training.shape[0]

 0    0.525104
-1    0.202396
 2    0.131823
-2    0.123802
 3    0.011198
 4    0.003385
 1    0.000885
 7    0.000625
 5    0.000469
 6    0.000313
Name: PAY_2, dtype: float64

In [22]:
testing['PAY_2'].value_counts() / testing.shape[0]

 0    0.518125
-1    0.206042
-2    0.138542
 2    0.122708
 3    0.009167
 4    0.002083
 5    0.001667
 1    0.000625
 7    0.000417
 6    0.000417
 8    0.000208
Name: PAY_2, dtype: float64

In [24]:
train['PAY_0'].value_counts()

 0    11768
-1     4576
 1     2925
-2     2243
 2     2131
 3      251
 4       58
 5       20
 8       14
 6        8
 7        6
Name: PAY_0, dtype: int64

In [5]:
## Chaning labels


## Changing labels to dummies 
training = pd.concat([training.drop(columns = 'SEX', axis = 1), pd.get_dummies(training['SEX'])], axis = 1)
training.head()

,LIMIT_BAL,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,PAY_6,BILL_AMT1,BILL_AMT2,BILL_AMT3,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month,1,2
802,20000,3,1,51,2,0,0,0,0,0,14815,15837,16852,17188,17546,17895,1264,1279,615,635,639,664,0,1,0
9908,50000,2,1,45,0,0,0,0,0,0,49073,12630,9215,9215,8011,5615,2022,2000,0,1000,1904,1664,0,0,1
483,20000,2,2,36,0,0,2,2,3,2,11423,13976,13455,15227,14699,14313,2749,0,2000,0,0,1230,0,1,0
2566,160000,1,1,53,0,0,0,0,0,0,52607,53548,56214,57246,58443,59883,2834,3500,2500,2207,2500,2300,0,0,1
11838,70000,2,1,34,0,0,0,0,0,0,50488,47018,46871,41821,41344,41376,2200,2015,2000,1500,1700,2000,0,0,1

In [ ]:
## Strong heredity